Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetFatherComponent Method
 Returns the father component of the model object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseComponent GetFatherComponent()
Public Function GetFatherComponent As BaseComponent
Return Value
Type: BaseComponent
A base component on success, otherwise null.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace